---
kind: type
id: T:Autodesk.Revit.DB.PaperSize
source: html/745f5625-3f9e-55f6-5e5a-659224ab360b.htm
---
# Autodesk.Revit.DB.PaperSize

An object that represents a Paper Size of Print Setup within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class PaperSize : APIObject
```

## Remarks
This object derived from the APIObject base object.